
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//+Дмитрий@, 6 июня 2024 г. 12:42:25 Домашнее задание к занятию «Внесение изменений в конфигурацию на поддержке»
	ДобавлениеНовыхЭлементовНаФорму();
	//+/Дмитрий@, 6 июня 2024 г. 12:42:25
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область Доработки

//+Дмитрий@, 6 июня 2024 г. 14:29:44 Домашнее задание к занятию «Внесение изменений в конфигурацию на поддержке»
&НаСервере
Процедура ДобавлениеНовыхЭлементовНаФорму()   
	Расш1_ДобавлениеРеквезитов.ДобавитьГруппуНаФорму(ЭтотОбъект,"Группа1","ГруппаШапкаЛево",,,,,,); 
	Расш1_ДобавлениеРеквезитов.ДобавитьРазместитьКомандуФормы(ЭтотОбъект,"Пересчитать","Расш1_Пересчитать","Группа1");
	
	МассивСтруктур = Новый Массив;
	Структура = Новый Структура;
	Структура.Вставить("Событие","ПриИзменении");
	Структура.Вставить("Действие","Расш1_СогласованнаяСкидкаПриИзменении");
	МассивСтруктур.Добавить(Структура); 
	
	Расш1_ДобавлениеРеквезитов.РазместитьРеквизитНаФорме(ЭтотОбъект,"Расш1_СогласованнаяСкидка","Группа1","Объект.Расш1_СогласованнаяСкидка",,,,,,,МассивСтруктур);
КонецПроцедуры 

&НаКлиенте
Процедура Расш1_СогласованнаяСкидкаПриИзменении(Элемент)
	
	Если Объект.Товары.Количество()<>0 ИЛИ Объект.Услуги.Количество()<>0 Тогда
		ПересчитатьТаблицы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьТаблицы()
	
	Для Каждого Строка Из Объект.Товары Цикл  
		Пересчитать(Строка);     		   
	КонецЦикла; 
	
	Для Каждого Строка Из Объект.Услуги  Цикл
	    Пересчитать(Строка);  	
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура Пересчитать(Строка)
	СуммаСтроки = Строка.Цена * Строка.Количество;
	Скидка=Окр(СуммаСтроки/100*Объект.Расш1_СогласованнаяСкидка,2); 
	Строка.Сумма =СуммаСтроки-Скидка; 
КонецПроцедуры

&НаКлиенте
Асинх Процедура Расш1_Пересчитать(Команда)
	
	Если Объект.Товары.Количество()<>0 ИЛИ Объект.Услуги.Количество()<>0 Тогда
		Результат = Ждать ВопросАсинх("Необходим пересчёт табличной части. Пересчитать?", РежимДиалогаВопрос.ДаНет);

         Если Результат = КодВозвратаДиалога.Да Тогда
             ПересчитатьТаблицы();
		 КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры
//+/Дмитрий@, 6 июня 2024 г. 14:29:44


#КонецОбласти

